CSI API ETABS v1
cDetailing.GetDetailedBeamLines Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedBeamLines(
	ref int NumberItems,
	ref string[] BeamLineIDs
)
Function GetDetailedBeamLines (
	ByRef NumberItems As Integer,
	ByRef BeamLineIDs As String()
) As Integer
Dim instance As cDetailing
Dim NumberItems As Integer
Dim BeamLineIDs As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedBeamLines(NumberItems,
	BeamLineIDs)
int GetDetailedBeamLines(
	int% NumberItems,
	array<String^>^% BeamLineIDs
)
abstract GetDetailedBeamLines :
        NumberItems : int byref *
        BeamLineIDs : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
BeamLineIDs
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace